// Функція findMatches() приймає довільну кількість аргументів.
// Першим аргументом завжди буде масив чисел,
// а решта аргументів будуть просто числами.

// Доповни код функції таким чином, щоб вона повертала
// новий масив matches, в якому будуть тільки ті
// аргументи, починаючи з другого, які є в масиві першого аргументу.

// Наприклад, findMatches([1, 2, 3, 4, 5], 1, 8, 2, 7)
// повинна повернути масив[1, 2],
// тому що тільки вони є в масиві першого аргументу.

//ТЕСТИ

// Оголошена функція findMatches()
// Виклик findMatches([1, 2, 3, 4, 5], 1, 8, 2, 7) повертає [1, 2]
// Виклик findMatches([4, 89, 17, 36, 2], 8, 17, 89, 27, 2) повертає [17, 89, 2]
// Виклик findMatches([10, 24, 41, 6, 9, 19], 24, 11, 9, 23, 41) повертає [24, 9, 41]
// Виклик findMatches([63, 11, 8, 29], 4, 7, 16) повертає []

// ------------------ВИКОНАЙТЕ КОД НИЖЧЕ----------------------//

// // Change code below this line
// function findMatches() {
//   const matches = []; // Don't change this line

//   // Change code above this line
//   return matches;
// }

// ------------------ВИКОНАНИЙ КОД ----------------------//

function findMatches(arr1, ...arr2) {
  const matches = []; // Don't change this line

  for (const key of arr2) {
    if (arr1.includes(key)) {
      matches.push(key);
    }
  }

  return matches;
}

console.log(findMatches([1, 2, 3, 4, 5], 1, 8, 2, 7)); //   повертає [1, 2]
console.log(findMatches([4, 89, 17, 36, 2], 8, 17, 89, 27, 2)); //   повертає [17, 89, 2]
console.log(findMatches([10, 24, 41, 6, 9, 19], 24, 11, 9, 23, 41)); //   повертає [24, 9, 41]
console.log(findMatches([63, 11, 8, 29], 4, 7, 16)); //   повертає []
